// Assuming that the function is called: wordsToNumbers(str)

var          r =0,          // test flag
    total_tests=0;          // counter for total tests performed

//=============================
// Standard 1-99
//=============================
r |= test('واحد',"1");
r |= test('واحدة',"1");
r |= test('اثنان',"2");
r |= test('اثنين',"2");
r |= test('اثنتان',"2");
r |= test('اثنتين',"2");
r |= test('ثنان',"2");
r |= test('ثنين',"2");
r |= test('ثلاثة',"3");
r |= test('ثلاث',"3");
r |= test('أربعة',"4");
r |= test('أربع',"4");
r |= test('خمسة',"5");
r |= test('خمس',"5");
r |= test('ستة',"6");
r |= test('ست',"6");
r |= test('سبعة',"7");
r |= test('سبع',"7");
r |= test('ثمانية',"8");
r |= test('ثمان',"8");
r |= test('ثماني',"8");
r |= test('تسعة',"9");
r |= test('تسع',"9");
r |= test('عشرة',"10");
r |= test('عشر',"10");
r |= test('إحدى عشر',"11");
r |= test('أحد عشر',"11");
r |= test('اثنى عشر',"12");
r |= test('ثنى عشر',"12");
r |= test('ثنتى عشر',"12");
r |= test('ثنتى عشرة',"12");
r |= test('اثنا عشر',"12");
r |= test('ثنا عشر',"12");
r |= test('اثنتا عشر',"12");
r |= test('اثنتا عشرة',"12");
r |= test('ثنتا عشر',"12");
r |= test('ثنتا عشرة',"12");
r |= test('اثني عشر',"12");
r |= test('ثني عشر',"12");
r |= test('اثنتي عشر',"12");
r |= test('اثنتي عشرة',"12");
r |= test('ثنتي عشر',"12");
r |= test('ثنتي عشرة',"12");
r |= test('ثلاث عشرة',"13");
r |= test('ثلاث عشر',"13");
r |= test('ثلاثة عشر',"13");
r |= test('أربع عشر',"14");
r |= test('أربع عشرة',"14");
r |= test('أربعة عشر',"14");
r |= test('خمس عشرة',"15");
r |= test('خمس عشر',"15");
r |= test('خمسة عشر',"15");
r |= test('ستة عشرة',"16");
r |= test('ستة عشر',"16");
r |= test('ست عشرة',"16");
r |= test('ست عشر',"16");
r |= test('سبع عشر',"17");
r |= test('سبع عشرة',"17");
r |= test('سبعة عشر',"17");
r |= test('سبعة عشرة',"17");
r |= test('سبعة عشر',"17");
r |= test('ثمان عشر',"18");
r |= test('ثماني عشر',"18");
r |= test('ثمانية عشر',"18");
r |= test('ثمانية عشرة',"18");
r |= test('تسع عشرة',"19");
r |= test('تسع عشر',"19");
r |= test('تسعة عشر',"19");
r |= test('تسعة عشرة',"19");
r |= test('عشرين',"20");
r |= test('عشرون',"20");
r |= test('واحد وعشرون',"21");
r |= test('واحد وعشرين',"21");
r |= test('واحدة وعشرون',"21");
r |= test('احدى وعشرون',"21");
r |= test('احدى وعشرين',"21");
r |= test('ثلاثين',"30");
r |= test('ثلاثون',"30");
r |= test('إحدى وثلاثين',"31");
r |= test('اثنين وثلاثين',"32");
r |= test('ثلاث وثلاثين',"33");
r |= test('ثلاثة وثلاثين',"33");
r |= test('أربعة وثلاثين',"34");
r |= test('خمسة وثلاثين',"35");
r |= test('خمس وثلاثين',"35");
r |= test('خمسة وثلاثون',"35");
r |= test('ست وثلاثون',"36");
r |= test('ستة وثلاثون',"36");
r |= test('ست وثلاثين',"36");
r |= test('ستة وثلاثين',"36");
r |= test('أربعون',"40");
r |= test('أربعين',"40");
r |= test('خمسون',"50");
r |= test('خمسين',"50");
r |= test('إحدى وخمسين',"51");
r |= test('ستين',"60");
r |= test('ستون',"60");
r |= test('واحد وستون',"61");
r |= test('احدى وستون',"61");
r |= test('ثلاثة وستون',"63");
r |= test('أربع وستون',"64");
r |= test('خمسة وستون',"65");
r |= test('ست وستون',"66");
r |= test('ستة وستون',"66");
r |= test('سبعين',"70");
r |= test('سبعون',"70");
r |= test('واحد وسبعون',"71");
r |= test('اثنان وسبعون',"72");
r |= test('اثنين وسبعون',"72");
r |= test('اثنتان وسبعون',"72");
r |= test('اثنتين وسبعون',"72");
r |= test('ثلاثة وسبعون',"73");
r |= test('ثلاثة وسبعين',"73");
r |= test('ثلاث وسبعون',"73");
r |= test('ثلاث وسبعين',"73");
r |= test('ثمان و سبعون',"78");
r |= test('ثمانين',"80");
r |= test('ثمانون',"80");
r |= test('واحد وثمانين',"81");
r |= test('احدى وثمانين',"81");
r |= test('واحدة وثمانين',"81");
r |= test('اثنين وثمانين',"82");
r |= test('اثنان وثمانين',"82");
r |= test('ثلاث وثمانين',"83");
r |= test('ثلاثة وثمانين',"83");
r |= test('ثماني وثمانين',"88");
r |= test('ثمان وثمانون',"88");
r |= test('ثمان و ثمانون',"88");
r |= test('تسعون',"90");
r |= test('تسعين',"90");
r |= test('واحد وتسعون',"91");
r |= test('واحدة وتسعون',"91");
r |= test('احدى وتسعون',"91");
r |= test('تسع وتسعون',"99");
r |= test('تسعة وتسعون',"99");

if (r==0) console.log("✅ (المستوى 01) - تحويل الأعداد المكتوبة من الـ 1 إلى الـ99");
var r=0;        // test flag
//=============================
// Standard 100-999
//=============================
r |= test('مئة',"100");
r |= test('مائة',"100");
r |= test('مئة وواحد',"101");
r |= test('مائة واثنين',"102");
r |= test('مائة واثنتين',"102");
r |= test('مائة واثنان',"102");
r |= test('مائة واثنتان',"102");
r |= test('مئة واثنين',"102");
r |= test('مئة واثنتين',"102");
r |= test('مئة واثنان',"102");
r |= test('مئة واثنتان',"102");
r |= test('مئة وثلاثة',"103");
r |= test('مائة وثلاثة',"103");
r |= test('مئة وثلاث',"103");
r |= test('مائة وثلاث',"103");
r |= test('مئة واربع',"104");
r |= test('مائة واربع',"104");
r |= test('مئة وخمس',"105");
r |= test('مائة وخمس',"105");
r |= test('مئة واحدى عشر',"111");
r |= test('مائة وأحد عشر',"111");
r |= test('مئة واثنتا عشر',"112");
r |= test('مئة واثنتى عشر',"112");
r |= test('مئة واثنتي عشر',"112");
r |= test('مئة واثنى عشر',"112");
r |= test('مئة واثنا عشر',"112");
r |= test('مئة وثلاث عشر',"113");
r |= test('مائة واثنتا عشر',"112");
r |= test('مائة واثنتى عشر',"112");
r |= test('مائة واثنتي عشر',"112");
r |= test('مائة واثنى عشر',"112");
r |= test('مائة واثنا عشر',"112");
r |= test('مائة وثلاث عشر',"113");
r |= test('مئة وثلاث عشر',"113");
r |= test('مئة وأربعة عشر',"114");
r |= test('مائة وأربعة عشر',"114");
r |= test('مئة وأربع عشرة',"114");
r |= test('مائة وأربع عشرة',"114");
r |= test('مئة وعشرين',"120");
r |= test('مئة وعشرون',"120");
r |= test('مائة وعشرين',"120");
r |= test('مائة وعشرون',"120");
r |= test('مئة وواحد وعشرين',"121");
r |= test('مئة وواحد وعشرون',"121");
r |= test('مئة واحدى وعشرين',"121");
r |= test('مئة وواحد وعشرين',"121");
r |= test('مئة وثلاثة وثلاثون',"133");
r |= test('مئة وثلاثا وثلاثون',"133");
r |= test('مئة وأربعة وأربعون',"144");
r |= test('مئة وأربعا وأربعون',"144");
r |= test('مئة وخمسا وخمسون',"155");
r |= test('مئة وستة وستون',"166");
r |= test('مئة وستا وستون',"166");
r |= test('مئة وسبع وسبعون',"177");
r |= test('مئة وثمان وثمانون',"188");
r |= test('مئة وواحد وتسعون',"191");
r |= test('مئة وتسعة وتسعون',"199");
r |= test('مئة وتسعا وتسعون',"199");
r |= test('مائتين',"200");
r |= test('مائتان',"200");
r |= test('مئتان',"200");
r |= test('مئتين',"200");
r |= test('مئتان واحدى عشر',"211");
r |= test('مئتان واثنى عشر',"212");
r |= test('مئتان وواحد وعشرين',"221");
r |= test('مئتان واحدى وعشرين',"221");
r |= test('مئتان واثنان وعشرين',"222");
r |= test('ثلاث مائة',"300");
r |= test('ثلاثمائة',"300");
r |= test('ثلاثمائة',"300");
r |= test('ثلاث مئة',"300");
r |= test('ثلاثمئة',"300");
r |= test('ثلاثمئة وعشرين',"320");
r |= test('ثلاثمئة واحدى وثلاثون',"331");
r |= test('ثلاثمئة وواحد وثلاثين',"331");
r |= test('ثلاثمئة واثنين وثلاثين',"332");
r |= test('ثلاثمئة وثلاثة وثلاثون',"333");
r |= test('أربع مئة',"400");
r |= test('أربعمئة',"400");
r |= test('أربعمائة',"400");
r |= test('أربع مئة وإحدى وأربعين',"441");
r |= test('أربع مئة وأربع وأربعون',"444");
r |= test('خمسمئه',"500");
r |= test('خمسمائه',"500");
r |= test('خمسمئة وخمسة وخمسون',"555");
r |= test('خمسمئة واثنان وخمسون',"552");
r |= test('خمس مئة وخمسة وخمسون',"555");
r |= test('ست مئة',"600");
r |= test('ست مائة',"600");
r |= test('ستمئة',"600");
r |= test('ستمائة',"600");
r |= test('ستمائة وستة وستون',"666");
r |= test('سبع مئة',"700");
r |= test('سبعمئة',"700");
r |= test('سبعمائة',"700");
r |= test('سبعمئة وسبع وسبعين',"777");
r |= test('ثمانمائة',"800");
r |= test('ثمان مائة',"800");
r |= test('ثمانمئة',"800");
r |= test('ثمان مئة',"800");
r |= test('ثمانمائه',"800");
r |= test('ثمان مئة وثمانيا وثمانون',"888");
r |= test('ثماني مائة وثمانيا وثمانون',"888");
r |= test('تسع مائة',"900");
r |= test('تسعمائة',"900");
r |= test('تسع مئة',"900");
r |= test('تسعمئة',"900");
r |= test('تسعمائة وعشرون',"920");
r |= test('تسعمائة وتسعة وتسعون',"999");
r |= test('تسعمائة وتسع وتسعين',"999");

if (r==0) console.log("✅ (المستوى 02) - تحويل الأعداد المكتوبة من الـ100 إلى الـ999");
var r=0; // test flag

//=============================
// 1000 and above
//=============================
r |= test('ألف',"1000");
r |= test('ألفان',"2000");
r |= test('ثلاثة آلاف',"3000");
r |= test('خمسة الاف',"5000");
r |= test('عشرة آلاف',"10000");
r |= test('عشرة آلاف ومئة',"10100");
r |= test('أحد عشر الف ومئة',"11100");
r |= test('اثنا عشر الف ومئة',"12100");
r |= test('اثنا عشر الف ومئتان',"12200");
r |= test('عشرين الف',"20000");
r |= test('عشرين الف',"20000");
r |= test('خمسون الف',"50000");
r |= test('خمسون الفا',"50000");
r |= test('مئة الف',"100000");
r |= test('مئة الف وواحد',"100001");
r |= test('مئة الف واثنان',"100002");
r |= test('مائة الف وأحد عشر',"100011");
r |= test('مائة الف ومئة',"100100");
r |= test('مئة الفا',"100000");
r |= test('مئتا الف',"200000");
r |= test('مائتا الف',"200000");
r |= test('مئتي الف',"200000");
r |= test('مائتي الف',"200000");
r |= test('ثلاثمائة الف',"300000");
r |= test('ثلاثمئة الف',"300000");
r |= test('ثلاث مائة الف',"300000");
r |= test('ثلاث مئة الف',"300000");
r |= test('أربعمائة الف',"400000");
r |= test('أربعمئة الف',"400000");
r |= test('أربع مائة الف',"400000");
r |= test('أربع مئة الف',"400000");
r |= test('خمسمائة الف',"500000");
r |= test('خمسمئة الف',"500000");
r |= test('خمس مائة الف',"500000");
r |= test('خمس مئة الف',"500000");
r |= test('ستمائة الف',"600000");
r |= test('ستمئة الف',"600000");
r |= test('ست مائة الف',"600000");
r |= test('ست مئة الف',"600000");
r |= test('سبعمائة الف',"700000");
r |= test('سبعمئة الف',"700000");
r |= test('سبع مائة الف',"700000");
r |= test('سبع مئة الف',"700000");
r |= test('ثمانمائة الف',"800000");
r |= test('ثمانمئة الف',"800000");
r |= test('ثمان مائة الف',"800000");
r |= test('ثمان مئة الف',"800000");
r |= test('تسعمائة الف',"900000");
r |= test('تسعمئة الف',"900000");
r |= test('تسع مائة الف',"900000");
r |= test('تسع مئة الف',"900000");
r |= test('مليون',"1000000");
r |= test('مليونان',"2000000");
r |= test('ثلاثة ملايين',"3000000");
r |= test('أربعة ملايين',"4000000");
r |= test('خمسة ملايين',"5000000");
r |= test('خمسون مليون',"50000000");
r |= test('خمسون مليونا',"50000000");
r |= test('مليار',"1000000000");
r |= test('ملياران',"2000000000");
r |= test('ملياران ومئتان',"2000000200");
r |= test('ملياران وألفان',"2000002000");
r |= test('ملياران وعشرين ألف',"2000020000");
r |= test('ملياران ومئتا ألف',"2000200000");
r |= test('ملياران ومليونان',"2002000000");
r |= test('ثلاثة مليارات',"3000000000");
r |= test('بليون',"1000000000");
r |= test('بليونان',"2000000000");
r |= test('ثلاثة بلايين',"3000000000");
r |= test('أربعة بلايين',"4000000000");
r |= test('خمسة بلايين',"5000000000");
r |= test('ستة بلايين',"6000000000");
r |= test('سبعة بلايين',"7000000000");
r |= test('ثمانية بلايين',"8000000000");
r |= test('تسعة بلايين',"9000000000");
r |= test('عشرة آلاف ومئة وخمسة وخمسون',"10155");
r |= test('عشرة آلاف و مئة و  خمسة و خمسون',"10155");


if (r==0) console.log("✅ (المستوى 03) - تحويل الأعداد المكتوبة من الألف فما فوق");
var r=0; // test flag

//=====================================
// Handling "هــاء" and "تاء مربوطة"
//=====================================
r |= test('واحده',"1");
r |= test('ثلاثه',"3");
r |= test('أربعه',"4");
r |= test('خمسه',"5");
r |= test('سته',"6");
r |= test('سبعه',"7");
r |= test('ثمانيه',"8");
r |= test('تسعه',"9");
r |= test('عشره',"10");
r |= test('ثلاثه عشر',"13");
r |= test('ثلاث عشره',"13");
r |= test('أربع عشره',"14");
r |= test('أربعة عشره',"14");
r |= test('أربعه عشره',"14");
r |= test('خمس عشره',"15");
r |= test('خمسه عشر',"15");
r |= test('خمسه عشره',"15");
r |= test('ستة عشره',"16");
r |= test('سبعة عشره',"17");
r |= test('سبعه عشره',"17");
r |= test('ثمانيه عشر',"18");
r |= test('ثمانيه عشره',"18");
r |= test('تسع عشره',"19");
r |= test('تسعه عشره',"19");
r |= test('تسعه عشر',"19");
r |= test('مائه',"100");
r |= test('مئه',"100");

if (r==0) console.log("✅ (المستوى 04) - التعامل مع التاء المربوطة والهاء");
var r=0; // test flag

//=====================================
// Simple madd
//=====================================
r |= test('واحـــــد',"1");
r |= test('اثنـــين',"2");
r |= test('اثنـــان',"2");
r |= test('ثلاثــة',"3");
r |= test('أربعــة',"4");
r |= test('أربــــع',"4");
r |= test('خمــــس',"5");
r |= test('خمــــســة',"5");
r |= test('ســت',"6");
r |= test('سبـــــع',"7");
r |= test('ثــمــانـــيـــة',"8");
r |= test('تـــســعـــة',"9");
r |= test('احــدى عشــر',"11");
r |= test('احــدا عشــر',"11");
r |= test('احــد عشــر',"11");
r |= test('أحد عشــر',"11");
r |= test('اثنــى عشـــر',"12");
r |= test('ثلاثــون',"30");
r |= test('أحــدى وثلاثــين',"31");
r |= test('أربعيــن',"40");
r |= test('خـمـسـون',"50");
r |= test('مــائــة',"100");
r |= test('مئتـــان',"200");
r |= test('ثـــلاث مــائــة',"300");
r |= test('ألفــــان',"2000");
r |= test('خمســـون الفا',"50000");

if (r==0) console.log("✅ (المستوى 05) - التعامل مع مد الحروف");
var r=0; // test flag

//=====================================
// Simple Tahmeez
//=====================================
r |= test('إثنين',"2");
r |= test('أثنين',"2");
r |= test('إثنان',"2");
r |= test('أثنان',"2");
r |= test('إثنتين',"2");
r |= test('أثنتين',"2");
r |= test('إثنتان',"2");
r |= test('أثنتان',"2");
r |= test('اربعة',"4");
r |= test('إربعة',"4");
r |= test('اربعه',"4");
r |= test('اربع',"4");
r |= test('إربع',"4");
r |= test('اربعون',"40");
r |= test('إربعون',"40");
r |= test('إحدى عشر',"11");
r |= test('أحدى عشر',"11");
r |= test('إثنى عشر',"12");
r |= test('أثنى عشر',"12");
r |= test('إثنا عشر',"12");
r |= test('أثنا عشر',"12");
r |= test('إثني عشر',"12");
r |= test('أثني عشر',"12");
r |= test('أحدى وثلاثين',"31");
r |= test('احدى وثلاثين',"31");
r |= test('أثنتين وثلاثين',"32");
r |= test('أثنتان وثلاثون',"32");

if (r==0) console.log("✅ (المستوى 06) - التعامل مع تهميز اللألِف البسيط");
var r=0; // test flag

//=====================================
// Simple tanween
//=====================================
r |= test('ثلاثا',"3");
r |= test('ثلاثًا',"3");
r |= test('ثلاثاً',"3");
r |= test('أربعا',"4");
r |= test('أربعًا',"4");
r |= test('أربعاً',"4");
r |= test('خمسا',"5");
r |= test('خمساً',"5");
r |= test('خمسًا',"5");
r |= test('ستا',"6");
r |= test('ستًا',"6");
r |= test('ستاً',"6");
r |= test('سبعا',"7");
r |= test('سبعًا',"7");
r |= test('سبعاً',"7");
r |= test('ثمانيا',"8");
r |= test('ثمانيًا',"8");
r |= test('ثمانياً',"8");
r |= test('ثمانًا',"8");
r |= test('ثمانا',"8");
r |= test('ثماناً',"8");
r |= test('تسعا',"9");
r |= test('تسعًا',"9");
r |= test('تسعاً',"9");
r |= test('عشرا',"10");
r |= test('عشرًا',"10");
r |= test('عشراً',"10");
r |= test('ثلاثا وثلاثين',"33");
r |= test('ثلاثًا وثلاثين',"33");
r |= test('ثلاثاً وثلاثين',"33");
r |= test('أربعا وأربعون',"44");
r |= test('أربعًا وأربعون',"44");
r |= test('أربعاً وأربعون',"44");
r |= test('خمسا وخمسون',"55");
r |= test('خمسًا وخمسون',"55");
r |= test('خمساً وخمسون',"55");
r |= test('ستا وستين',"66");
r |= test('ستًا وستين',"66");
r |= test('ستاً وستين',"66");
r |= test('سبعا وسبعون',"77");
r |= test('سبعًا وسبعون',"77");
r |= test('سبعاً وسبعون',"77");
r |= test('ثمانا وسبعون',"78");
r |= test('ثمانًا وسبعون',"78");
r |= test('ثمانيا وثمانين',"88");
r |= test('ثمانيًا وثمانين',"88");
r |= test('ثمانياً وثمانين',"88");
r |= test('ثمانا وثمانون',"88");
r |= test('ثمانًا وثمانون',"88");
r |= test('ثماناً وثمانون',"88");
r |= test('تسعا وتسعون',"99");
r |= test('تسعًا وتسعون',"99");
r |= test('تسعاً وتسعون',"99");


if (r==0) console.log("✅ (المستوى 07) - التعامل مع تنوين الألِف البسيط");
var r=0; // test flag

//====================================
// Excess spaces
//====================================
r |= test('عشر ون',"20");
r |= test('عشر ين',"20");
r |= test('واحد و  ستون',"61");
r |= test('واحد و سبعون',"71");
r |= test('ثلاثة و ستون',"63");
r |= test('تسعة و   تسعون',"99");
r |= test('مئتان و اثنان  و عشرين',"222");
r |= test('ثمان   مئة',"800");
r |= test('ثمانمئة  و  ثمانيا  و  ثمانون',"888");
r |= test('تسع   مئة',"900");
r |= test('ألف  ومئة     وعشرون',"1120");
r |= test('ألفان       و     مئة     وعشرون',"2120");


if (r==0) console.log("✅ (المستوى 08) - التعامل مع الفراغات الإضافية");
var r=0; // test flag

//=============================
// Missing Spaces
//=============================
r |= test('أحدعشر',"11");
r |= test('اثناعشر',"12");
r |= test('اثنتاعشر',"12");
r |= test('ثلاثعشر',"13");
r |= test('اربعتعشر',"14");
r |= test('اربععشر',"14");
r |= test('اربعشر',"14");
r |= test('خمستعشر',"15");
r |= test('ستعشر',"16");
r |= test('سبعتعشره',"17");
r |= test('سبعتعشر',"17");
r |= test('واحدوعشرون',"21");
r |= test('ثلاثوعشرون',"23");
r |= test('تسعوتسعون',"99");


if (r==0) console.log("✅ (المستوى 09) - التعامل مع الكتابة بدون فراغات");
var r=0; // test flag


//=============================
// Handle commas
//=============================
r |= test('ألف ، ومئة     وعشرون',"1120");
r |= test('ألف،ومئة     وعشرون',"1120");
r |= test('ألف ،    ومئة     وعشرون',"1120");
r |= test('ألفان ومئة     وعشرون',"2120");
r |= test('ألفان   ،    و     مئة     وعشرون',"2120");
r |= test('ألفان   ،    و     مئة     و      عشرون',"2120");


if (r==0) console.log("✅ (المستوى 10) - التعامل مع الفواصل بين الكلمات");
var r=0; // test flag

//=============================
// reversed
//=============================
r |= test('عشر ومئة',"110");
r |= test('واحد وعشرون ومئة',"121");
r |= test('واحد وعشرون ومئتان',"221");
r |= test('خمسون ومئتان',"250");
r |= test('خمسون وثلاثمائة',"350");
r |= test('اثنان وعشرون وألفان',"2022");
r |= test('خمسون ومئة',"150");
r |= test("مئتان وألف","1200");
r |= test("وثلاثمئة وألف","و1300");
r |= test("اثنان وعشرون وألفان","2022");
r |= test("اثنان وعشرون وتسعمائة وألف","1922");
r |= test("ألف ومليون","1001000");
r |= test("ثلاثة آلاف ومائة ألف","103000");
r |= test("ثلاثون ألفا ومائة ألف","130000");


if (r==0) console.log("✅ (المستوى 11) - تحويل الأعداد المكتوبة من اليمين إلى اليسار");
var r=0; // test flag

//=============================
// Stand Alone not be combined
//=============================
r |= test("واحد واحد ثلاثة أربعة خمسة ستة سبعة",'1 1 3 4 5 6 7');
r |= test('مئتان واحد',"200 1");
r |= test("اثنان ثلاثة أربعة خمسة ستة سبعة",'2 3 4 5 6 7');
r |= test("ثلاثة ميتين",'3 200');
r |= test("خمستعش ميتين",'15 200');
r |= test("ثلاثه ميتين عشرين",'3 200 20');
r |= test("ثلاثعشرمية",'13100');
r |= test('عشر ميه',"10 100");
r |= test('خمسون ميه',"50 100");
r |= test('عشرة آلاف مئة',"10000 100");
r |= test('مئة الفان',"100 2000");
r |= test('خمسون، عشرون، مئة',"50، 20، 100");

if (r==0) console.log("✅ (المستوى 12) - تحويل الأعداد المستقلة بدون تركيب");
var r=0; // test flag


//=============================
// Simple colloquial text
//=============================

r |= test('تلاثه',"3");
r |= test('تلاته',"3");
r |= test('تلاث',"3");
r |= test('تمان',"8");
r |= test('تمانيه',"8");
r |= test('تمنيه',"8");
r |= test("حدش","11");
r |= test("حداش","11");
r |= test('اثناش',"12");
r |= test('اتناش',"12");
r |= test("تنش","12");
r |= test("تنعش","12");
r |= test("ثنعش","12");
r |= test("تناش","12");
r |= test("ثناش","12");
r |= test("طناش","12");
r |= test("طنش","12");
r |= test('ثلتاش',"13");
r |= test('تلاته عشر',"13");
r |= test('تلات عشر',"13");
r |= test("طلتش","13");
r |= test("طلتاش","13");
r |= test("تلتش","13");
r |= test("تلتاش","13");
r |= test('اربعتاش',"14");
r |= test("ربعتش","14");
r |= test("ربعتاش","14");
r |= test("خمستش","15");
r |= test("خمسطش","15");
r |= test("خمستاش","15");
r |= test("خمسطاش","15");
r |= test("ستتش","16");
r |= test("ستش","16");
r |= test("ستاش","16");
r |= test("ستعش","16");
r |= test('سبعتاش',"17");
r |= test("سبتش","17");
r |= test("سبعتش","17");
r |= test("سبعتاش","17");
r |= test("سبتاش","17");
r |= test("سباتش","17");
r |= test("صباتش","17");
r |= test("صبعتش","17");
r |= test("صوباتش","17");
r |= test("تمنتش","18");
r |= test("تمنتاش","18");
r |= test("ثمنتش","18");
r |= test("ثمنتاش","18");
r |= test('تسعتاش',"19");
r |= test('تسعتعشر',"19");
r |= test('تسعتاعشر',"19");
r |= test('تسعتش',"19");
r |= test("تستش","19");
r |= test("تستاش","19");
r |= test("تيستش","19");
r |= test("تيستش","19");
r |= test("تيستاش","19");

r |= test('تمانين',"80");
r |= test('تمينين',"80");
r |= test('تمانون',"80");

r |= test('ميه',"100");
r |= test('مية',"100");
r |= test('ميه وواحد',"101");
r |= test('مية واحدى عشر',"111");
r |= test('مية واثنى عشر',"112");
r |= test('مية وثلاث عشر',"113");
r |= test('مية وأربعة عشر',"114");
r |= test('مية وأربع عشرة',"114");
r |= test('مية وعشرين',"120");
r |= test('ميه وواحدة وعشرين',"121");
r |= test('ميه وواحدة وعشرون',"121");
r |= test('ثنين مية',"200");
r |= test('ميتين',"200");
r |= test('ثلاثميه وعشرين',"320");
r |= test('ثلاثميه ووحده وعشرين',"321");


r |= test("واحد ميه","100");
r |= test("واحدميه","100");
r |= test("حدميه","100");
r |= test("حداميه","100");
r |= test("تنميه","200");
r |= test("ثنين ميه","200");
r |= test("تنين ميه","200");
r |= test("ثنينميه","200");
r |= test("تنينميه","200");
r |= test("ثنان ميه","200");
r |= test("تنان ميه","200");
r |= test("ثنانميه","200");
r |= test("تنانميه","200");
r |= test("ثنتين ميه","200");
r |= test("تنتين ميه","200");
r |= test("ثنتينميه","200");
r |= test("تنتينميه","200");
r |= test("تناميه","200");
r |= test("طنميه","200");
r |= test("ميتين","200");
r |= test('ثلثمية',"300");
r |= test('ثلث مية',"300");
r |= test('تلت مية',"300");
r |= test('ثلثمية',"300");
r |= test('تلتمية',"300");
r |= test('ثلاث مية',"300");
r |= test("طلتميه","300");
r |= test("طلتاميه","300");
r |= test("تلتميه","300");
r |= test("تلتوميه","300");
r |= test("تولتميه","300");
r |= test("تولتوميه","300");
r |= test("تلتاميه","300");
r |= test('ربعمية',"400");
r |= test('روبعمية',"400");
r |= test("ربعميه","400");
r |= test("ربوعميه","400");
r |= test("ربعاميه","400");
r |= test("ربعوميه","400");
r |= test('خمسميه',"500");
r |= test('خمس ميه',"500");
r |= test("خمسميه","500");
r |= test("خمساميه","500");
r |= test("خمسوميه","500");
r |= test("خومسميه","500");
r |= test("خومسوميه","500");
r |= test("ستميه","600");
r |= test("سوتميه","600");
r |= test("ستاميه","600");
r |= test("ستوميه","600");
r |= test("سبميه","700");
r |= test("سوبعميه","700");
r |= test("سوبعوميه","700");
r |= test("سبعوميه","700");
r |= test("سباميه","700");
r |= test("سوبعميه","700");
r |= test('ثمنميه',"800");
r |= test('ثمنمايه',"800");
r |= test('ثمنومايه',"800");
r |= test('ثمنمئه',"800");
r |= test("تمنميه","800");
r |= test("تمنوميه","800");
r |= test("ثومنميه","800");
r |= test("تومنميه","800");
r |= test("ثومنوميه","800");
r |= test("تومنوميه","800");
r |= test("ثمنميه","800");
r |= test("ثمناميه","800");
r |= test("تمناميه","800");
r |= test("تسعميه","900");
r |= test("تسعوميه","900");
r |= test("توسعميه","900");
r |= test("توسعوميه","900");
r |= test("تيسعميه","900");

if (r==0) console.log("✅ (المستوى 13) - التعامل مع الكتابة العامية والدارجة");
var r=0; // test flag


//=================================
// The word "and"
//=================================
r |= test('وواحد',"و1");
r |= test('واحدى عشر',"و11");
r |= test('واحدى وعشرون',"و21");
r |= test('واحد عشر',"11"); // special case
r |= test('واثنان',"و2");
r |= test('و  اثنان',"و  2");
r |= test('و خمسة',"و 5");
r |= test('وعشرة',"و10");
r |= test('و    عشرة',"و    10");
r |= test('وواحد وستون',"و61");
r |= test('وواحد وسبعون',"و71");
r |= test('واحدى وسبعون',"و71");
r |= test('و ثلاثون',"و 30");
r |= test('و   ثلاثين',"و   30");

if (r==0) console.log("✅ (المستوى 14) - التعامل مع حرف العطف (واو)");
var r=0; // test flag

//=============================
// Numbers with Text in between
//=============================
r |= test("واحد دينار",'1 دينار');
r |= test('اشتريت بخمسون ريالا',"اشتريت ب50 ريالا");
r |= test('قيمت الأرض لألف فدان بعشرة جنيهات وعشرة قروش',"قيمت الأرض ل1000 فدان ب10 جنيهات و10 قروش");
r |= test('قيمت الأرض لألــف فــدان بـعشــرة جنيهــات وعشرة قــروش',"قيمت الأرض ل1000 فــدان بـ10 جنيهــات و10 قــروش");
r |= test('تسعمائة كتاب',"900 كتاب");
r |= test('تسعمائة      كتاب',"900      كتاب");
r |= test('عشرة       آلاف',"10000");
r |= test('قرأت مئة كتاب في ستون يوما',"قرأت 100 كتاب في 60 يوما");
r |= test('ثنين مية نفرات',"200 نفرات");
r |= test('خمسة الاف كتاب',"5000 كتاب");
r |= test('قرأت مئة كتاب',"قرأت 100 كتاب");
r |= test('خمسة ملايين كتاب',"5000000 كتاب");
r |= test('بليون ريال',"1000000000 ريال");
r |= test('بليونين ريال',"2000000000 ريال");
r |= test('بليونان ريال',"2000000000 ريال");
r |= test('بليونان ريال',"2000000000 ريال");
r |= test('اثنين بليون ريال',"2000000000 ريال");
r |= test('مليار ريال',"1000000000 ريال");
r |= test('عدد سكان الصين مليار وخمسمئة مليون نسمة',"عدد سكان الصين 1500000000 نسمة");
r |= test('مليارا ريال',"2000000000 ريال");
r |= test('ملياري ريال',"2000000000 ريال");
r |= test('ترليون ريال',"1000000000000 ريال");
r |= test('اثنين ترليون ريال',"2000000000000 ريال");
r |= test('ترليونين جنيه',"2000000000000 جنيه");
r |= test('ترليونان دينار',"2000000000000 دينار");
r |= test('ثلاثة وعشرون ترليونا دولار',"23000000000000 دولار");
r |= test('ثلاثة    وعشرون     ترليونا     ومئة     وعشرون      مليونا      وثلاثون    ريالاً',"23000120000030    ريالاً");
r |= test('خمسة ملايين، وثلاثمئة ألف، وخمسمئة وواحد وثلاثين دينارًا',"5300531 دينارًا");
r |= test('ثلاثمئة ألف وخمسمئة     وواحد     وثلاثين    درهمًا',"300531    درهمًا");
r |= test('عشرون ألفا وثلاثمئة وخمسة وعشرون مترًا',"20325 مترًا");
r |= test("سنة اثنان وعشرون ومئتان وألف بعد الهجرة","سنة 1222 بعد الهجرة");
r |= test("خمس وحدات","5 وحدات");
r |= test("خمس وحدات","5 وحدات");
r |= test("لدي ألفان من الفلوس","لدي 2000 من الفلوس");
r |= test("لدي ألف من الفلوس","لدي 1000 من الفلوس");
r |= test("عشرة فنانين في مكتب الفن","10 فنانين في مكتب الفن");

if (r==0) console.log("✅ (المستوى 15) - تحويل الأعداد مع إبقاء أي كتابة إضافية أخرى");
var r=0; // test flag

//=============================
// Numbers with With tashkeel
//=============================
r |= test('اشتَرَيْتُ بِخَمْسُونَ رِيَالًا',"اشتَرَيْتُ بِ50 رِيَالًا");
r |= test('تُسْعُمِائَةَ كِتَابٍ',"900 كِتَابٍ");
r |= test('عَشْرَةَ       آلافٍ',"10000");
r |= test('قَرَأتُ مِئَةَ كِتَابٍ فِي سِتّونَ يَوْمَا',"قَرَأتُ 100 كِتَابٍ فِي 60 يَوْمَا");
r |= test('خَمْسَةُ آلافِ كِتَابٍ',"5000 كِتَابٍ");
r |= test('خَمْسَةُ مَلايِيِنِ كِتَابٍ',"5000000 كِتَابٍ");
r |= test('بِلْيُونَ رِيَالٍ',"1000000000 رِيَالٍ");
r |= test('بِلْيُونَا رِيَالٍ',"2000000000 رِيَالٍ");
r |= test('عَدَدُ سُكَّانُ الصّينِ مِلْيَارٌ وَخَمْسَمِئَةِ مِلْيُونَ نَسَمَةٍ',"عَدَدُ سُكَّانُ الصّينِ 1500000000 نَسَمَةٍ");
r |= test("خَمْسُمِائَةٍ وَتِسْعَةٌ وَسِتُّونَ","569");
r |= test("سَنَةُ اثْنَانِ وَعِشْرُونَ وَمِئَتَانِ وَألْفٍ بَعْدَ الهِجْرَةِ","سَنَةُ 1222 بَعْدَ الهِجْرَةِ");
r |= test("ألفان وخَمْسُمِائَةٍ وَتِسْعَةٌ وَسِتُّونَ","2569");
r |= test('ثَلَاثُمِائَةٍ وَأرْبَعَةٌ وَثَلَاثُونَ رِيَالًا قَطَرِيًّا',"334 رِيَالًا قَطَرِيًّا");
r |= test('مَبْلَغًا قَدرُهُ ثَلَاثُمِائَةٍ وَأرْبَعَةٌ وَثَلَاثُونَ رِيَالًا قَطَرِيًّا',"مَبْلَغًا قَدرُهُ 334 رِيَالًا قَطَرِيًّا");
r |= test('اثْنَانٌ وَعِشْرُونَ دُولَارًا جَامَايكِيًّا',"22 دُولَارًا جَامَايكِيًّا");
r |= test('ألْفَانِ، وَخَمْسُمِائَةٍ وَأرْبَعُونَ دُولَارًا جَامَايكِيًّا',"2540 دُولَارًا جَامَايكِيًّا");
r |= test('ألْفَا دُولَارٍ جَامَايكِيٍّ',"2000 دُولَارٍ جَامَايكِيٍّ");
r |= test('ألْفَا مِتْرٍ مُكَعَّبٍ',"2000 مِتْرٍ مُكَعَّبٍ");
r |= test('مِلْيُونَا مِتْرٍ مُكَعَّبٍ',"2000000 مِتْرٍ مُكَعَّبٍ");
r |= test('ثَلَاثُمِائَةٍ وَتِسْعَةٌ وَتِسْعُونَ جُنَيْهًا مِصْرِيًّا',"399 جُنَيْهًا مِصْرِيًّا");
r |= test('مِائَتَانِ وَخَمْسَةَ عَشَرَ مِلْيُونًا، وَسِتُّمِائَةٍ وَتِسْعَةٌ وَثَمَانُونَ ألْفًا، وَثَلَاثُمِائَةٍ وَتِسْعَةٌ وَتِسْعُونَ جُنَيْهًا مِصْرِيًّا',"215689399 جُنَيْهًا مِصْرِيًّا");
r |= test('تِسْعِمِائَةٍ وَتِسْعَةٍ وَتِسْعِينَ جُنَيْهًا مِصْرِيًّا',"999 جُنَيْهًا مِصْرِيًّا");
r |= test('تِسْعَةِ مَلَايينٍ، وَتِسْعِمِائَةٍ وَتِسْعَةٍ وَتِسْعِينَ ألْفًا، وَتِسْعِمِائَةٍ وَتِسْعٍ وَتِسْعِينَ لِيرَةً لُبْنَانِيَّةً',"9999999 لِيرَةً لُبْنَانِيَّةً");

if (r==0) console.log("✅ (المستوى 16) - تحويل الأعداد المكتوبة مع تشكيل كامل");
var r=0; // test flag



// following must NOT be translated as a standlone numbers
// as they are used for number 11-99 and 100's
r |= test("تن","تن");
r |= test("طن","طن");
r |= test("تس","تس");
r |= test("تيس","تيس");
r |= test("حد","حد");
r |= test("تل","تل");
r |= test("طل","طل");
r |= test("تمن","تمن");

//=============================
// following must NOT be translated
//=============================
r |= test('احدى',"احدى");
r |= test('احد',"احد");
r |= test('اثنا',"اثنا");
r |= test('اثني',"اثني");
r |= test('ثني',"ثني");
r |= test('اثنتا',"اثنتا");
r |= test('اثنتي',"اثنتي");
r |= test('ثنتي',"ثنتي");
r |= test("صفر","صفر");
r |= test("سالب","سالب");
r |= test("ناقص","ناقص");
r |= test('آلاف',"آلاف");
r |= test('الوفات',"الوفات");
r |= test('ملايين',"ملايين");
r |= test('مليونات',"مليونات");
r |= test('بلايين',"بلايين");
r |= test('بليونات',"بليونات");
r |= test('بلايين',"بلايين");
r |= test('مليارات',"مليارات");
r |= test('ميليارات',"ميليارات");
r |= test('ماليارات',"ماليارات");
r |= test('ثلث القصة',"ثلث القصة");

if (r==0) console.log("✅ (المستوى 17) - كتابة يجب عدم تحويلها");
var r=0; // test flag

if (r==0) console.log("✅ All "+new Intl.NumberFormat('en-US').format(total_tests)+" Test Cases Passed.");



}


//-----------------------------------
function test(str,Should) {
let result= wordsToNumbers(str);
if (result !== Should) {
console.log(`
${str} Output   :${result}
${str} Should be:${Should}
`);
return 1;
}
//-----------------------------------
total_tests++;
}
